# ================== главный экран
FPS = 60
WIDTH = 1200
HEIGHT = 800
# ================== игровое поле
WIDTH_FIELD = 1000
HEIGHT_FIELD = 600
TIMER_INTERVAL = 2000   # время на отдых/битвы на поле
TIMER_SEE = 500         # время для того, чтоб увидить расположение анархии  
MAX_COUNT_WEAPON = 5    # макс. количество ВИДОВ орудий  (мин 1, макс 5)
MAX_COUNT_DIRT = 0      # макс. количество грязи на поле 
# ================== игрок
SPEED = 10
HP = 200
# ================== пушка
DAMAGE_GUN = 10
SPEED_BULLET = 5
COOLDOWN_GUN = 500 
# ================== пила (диск)
DAMAGE_SAW = 5
# ================== цвета
BLACK = (0, 0, 0)
WHITE = (255, 255, 255)